src/lib/sugarsoapBinding.portal_get_entry_list_filter.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://www.sugarcrm.com/sugarcrm">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:portal_get_entry_list_filter>
   <session></session>
   <module_name></module_name>
   <order_by></order_by>
   <select_fields SOAP-ENC:arrayType="xsd:string[1]">
    <item></item>
   </select_fields>
   <row_offset>0</row_offset>
   <limit>0</limit>
   <filter SOAP-ENC:arrayType="ns1:name_value_operator[1]">
    <item>
     <name></name>
     <value></value>
     <operator></operator>
     <value_array SOAP-ENC:arrayType="xsd:string[1]">
      <item></item>
     </value_array>
    </item>
   </filter>
  </ns1:portal_get_entry_list_filter>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
